**Step 1 Data Exploration & Leading**

In [241]:
# Importing Depandencies

import pandas as pd 

# import "postgreSQL" toolkit

import psycopg2 # this will work as adapter
from sqlalchemy import create_engine

In [242]:
df = pd.read_csv("Walmart.csv", encoding_errors="ignore")
df.shape

(10051, 11)

In [243]:
df.columns = df.columns.str.lower()
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [244]:
df.head()

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [245]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [246]:
 # finding if data type is correct for given information 
 # Example:-  here unit_price Dtype is "object" where we need it in "int" type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   branch          10051 non-null  object
 2   city            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [247]:
# count all duplicated values

df.duplicated().sum()

np.int64(51)

In [248]:
df.drop_duplicates(inplace= True)   # to remove duplicate
df.duplicated().sum()               #count all duplicate value

np.int64(0)

In [249]:
# Count all NULL Value

df.isnull().sum()

invoice_id         0
branch             0
city               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [250]:
# Dropping all rows with missing records

df.dropna(inplace= True)
df.isnull().sum()             # Count all NULL Value

invoice_id        0
branch            0
city              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [251]:
df.shape

(9969, 11)

In [252]:
# Due to "$" Sign present with value so first we need to replace it so error don't occur while running code
# Now we will change "unit_price" data type into "Float" so we can work with that data in future

df['unit_price'] = df['unit_price'].str.replace("$","").astype(float)

df.head()

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [253]:
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [254]:
df.to_csv('walmart_clean_data.csv', index= False)

**Step 2: PostgreSQL Connection**

In [255]:
#     host="localhost",
#     port="5432",
#     user="postgres",
#     password="Admin"

In [256]:
# postgres connection
engine = create_engine("postgresql+psycopg2://postgres:Admin@localhost:5432/walmart_db")

try:
    engine
    print("Connection Sucessfull to postgresql")
except:
    print("Unable to connect")

Connection Sucessfull to postgresql

In [257]:
df.to_sql(
    name="walmart",
    con=engine,
    if_exists="replace",   #    recreates table with lowercase columns
    index=False
)

969

In [258]:
pd.read_sql(
    "SELECT table_name FROM information_schema.tables WHERE table_schema='public';",
    engine
)

  table_name
0    walmart

In [259]:
pd.read_sql("SELECT COUNT(*) FROM walmart;", engine)
pd.read_sql("SELECT * FROM walmart LIMIT 5;", engine)

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [260]:
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')